# Creación Dataset tesis

In [4]:
#Librerias necesarias

from  random import randint
import pandas as pd
import random

## TABLA 1 - identificacion del usuario

In [5]:
# ID 

usuario = []

for i in range (1,501):
    usuario.append (i)

In [6]:
len (usuario)

500

In [7]:
# Agregar el genero

genero = ['Hombre', 'Mujer']

sexo = []

for i in range (500):
    sexo.append (genero[randint (0,1)])

In [8]:
edad = []

for i in range (500):
    edad.append (randint(18,70))

In [9]:
# Ciudad
lista_ciudades = ['Vigo', 'Zaragoza', 'Bilbao', 'Valladolid', 'Cordoba', 'Malaga', 'Valencia', 'Gijón', 'Alicante', 'Sevilla', 'Las Palamas de GC', 'Murcia', 'Palma', 'Barcelona', 'Madrid ' ]

ciudad = []

for i in range (500):
    ciudad.append (lista_ciudades[randint(0,14)])

In [10]:
len (ciudad)

500

In [11]:
# Promedio gasto mensual 

gasto= []

for i in range (500):
    gasto.append (round(random.uniform(5.00, 500.00),2))

In [12]:
# Miembro plus
miembro_plus= []

for i in range (500):
    miembro_plus.append (randint(0,1))

In [13]:
# Dispositivo

lista_dispositivo = ['PC', 'Movil']

dispositivo= []


for i in range (500):
    dispositivo.append (lista_dispositivo[randint (0,1)])

In [14]:
#Tiempo en la pagina mensual

tiempo = []

for i in range (500):
   tiempo.append (round(random.uniform(0.55, 7.00),2))

In [15]:
#Diccionario de usuarios
diccionario_usuarios = {    
     'usuario': usuario,
     'genero': sexo,
     'edad': edad,
     'ciudad': ciudad,
     'gasto_mes': gasto,
     'miembro_plus': miembro_plus,
     'dispositivo': dispositivo,
     'tiempo_mes': tiempo 
 }

In [16]:
df0 = pd.DataFrame( diccionario_usuarios)

In [17]:
#Tabla de atributos de los usuarios 
df0

,usuario,genero,edad,ciudad,gasto_mes,miembro_plus,dispositivo,tiempo_mes
0,1,Mujer,21,Valladolid,483.81,0,PC,3.30
1,2,Mujer,45,Valladolid,186.30,1,PC,6.60
2,3,Mujer,64,Murcia,396.03,0,PC,2.09
3,4,Hombre,35,Vigo,233.32,1,PC,5.23
4,5,Mujer,56,Cordoba,497.87,1,PC,2.87
...,...,...,...,...,...,...,...,...
495,496,Hombre,53,Bilbao,289.28,1,Movil,1.11
496,497,Hombre,35,Vigo,432.91,1,PC,1.86
497,498,Mujer,61,Murcia,464.96,1,PC,4.24
498,499,Hombre,51,Palma,298.19,1,Movil,3.05
499,500,Hombre,29,Malaga,99.99,0,Movil,3.34

In [18]:
# Export df0 to .csv without index
df0.to_csv('users_data.csv', index=False)

## Tabla 2

In [19]:
df0.describe()

          usuario        edad   gasto_mes  miembro_plus  tiempo_mes
count  500.000000  500.000000  500.000000    500.000000  500.000000
mean   250.500000   44.180000  255.577020      0.490000    3.834820
std    144.481833   15.021548  143.969192      0.500401    1.779172
min      1.000000   18.000000    5.890000      0.000000    0.560000
25%    125.750000   32.000000  124.155000      0.000000    2.317500
50%    250.500000   44.000000  258.165000      0.000000    3.730000
75%    375.250000   57.000000  388.820000      1.000000    5.470000
max    500.000000   70.000000  497.870000      1.000000    7.000000

In [20]:
usuario = []

for i in range (10000):
    usuario.append (randint (1,500))

In [21]:
#usuario1 = [i for in range (10000) : ]

In [22]:
# Lista de categorias

categorias_lista = ['Deporte', 'Electronica', 'Cocina', 'Ropa', 'Zapatos', 'Juguetes', 'Hogar', 'Baño', 'Ferreteria', 'Libros', 'Accesorios']

categoria = []

for i in range (10000):
    categoria.append (categorias_lista[randint(0,10)])

In [23]:
numero_articulos =[]

for i in range (10000):
    numero_articulos.append (randint(1,11))

In [24]:
#Librerias necesarias

from datetime import datetime

In [25]:
# Prueba 2

In [26]:

import random
from datetime import datetime, timedelta

min_year=2019
max_year=2020

start = datetime(min_year, 1, 1, 00, 00, 00)
years = max_year - min_year+1
end = start + timedelta(days=365 * years)

fecha = []
for i in range(10000):
    random_date = start + (end - start) * random.random()
    fecha.append (random_date)

In [27]:
precio = []

for i in range(10000):
   precio.append(round(random.uniform(5, 500),2))

In [28]:
valoracion = []

for i in range(10000):
   valoracion.append(round(random.uniform(0, 5),1))

In [29]:
print (len(usuario))
print (len(categoria))
print (len(numero_articulos))
print (len(fecha))

10000
10000
10000
10000

In [30]:
df1 = pd.DataFrame (
    {'usuario': usuario,
    'categorias': categoria,
    'numero_articulos': numero_articulos,
    'fecha': fecha,
    'precio': precio,
    'valoracion': valoracion
    }
    
)

In [31]:
df1.head(3)

,usuario,categorias,numero_articulos,fecha,precio,valoracion
0,92,Baño,8,2019-03-27 21:08:33.786039,343.53,0.5
1,265,Baño,6,2019-08-08 15:19:19.873440,78.43,3.7
2,106,Baño,7,2020-11-10 18:56:30.101786,446.09,2.4

## Generacion de comentarios 

* rango: 
* 0-1.5 = 'muy malo', 'no cumple las expectativas', 'no llego el producto' 
* 1.5-2.5 = ' la calidad no es la esperada', 'el paquete llego en mal estado' , 'no llego en tiempo' 
* 2.5-3.5 = ' cumple las expectativas' , 'llego justo a tiempo' , 'me gusto' 
* 3.5-5 = ' muy bueno!', 'justo lo que esperaba' , 'buena relacion calidad-precio'

In [32]:
# asumimos que no hay valoracion menor a 0 

def comentarios(valoracion):


    comentarios0_1 = ['muy malo', 'no cumple las expectativas', 'no llego el producto' ]
    comentarios1_2 = [' la calidad no es la esperada', 'el paquete llego en mal estado' , 'no llego en tiempo'] 
    comentarios2_3 = [' cumple las expectativas' , 'llego justo a tiempo' , 'me gusto' ]
    comentarios3_5 = [' muy bueno!', 'justo lo que esperaba' , 'buena relacion calidad-precio' ]
    comentarios_clientes = []

    if valoracion <= 1.5:
        #comentarios_clientes.append (comentarios0_1 [randint(0,2)])
        return comentarios0_1[randint(0,2)]
    elif 1.5 < valoracion <= 2.5: 
       # comentraios_clientes.append (comentarios1_2 [randint(0,2)])
       return comentarios1_2[randint(0,2)]
    elif 2.5 < valoracion <= 3.5: 
        #comentarios_clientes.append (comentarios2_3 [randint(0,2)])
        return comentarios2_3[randint(0,2)]
    elif 3.5 < valoracion <= 5: 
        #comentarios_clientes.append (comentarios3_5 [randint(0,2)])
        return comentarios3_5[randint(0,2)]

In [33]:
comentarios (3)

'me gusto'

In [34]:
df1['comentarios'] = df1['valoracion']

In [35]:
 df1 ['comentarios'] = df1['comentarios'].apply(comentarios)

In [36]:
df1.head(3)

,usuario,categorias,numero_articulos,fecha,precio,valoracion,comentarios
0,92,Baño,8,2019-03-27 21:08:33.786039,343.53,0.5,no llego el producto
1,265,Baño,6,2019-08-08 15:19:19.873440,78.43,3.7,justo lo que esperaba
2,106,Baño,7,2020-11-10 18:56:30.101786,446.09,2.4,no llego en tiempo

In [37]:
df1.describe()

            usuario  numero_articulos        precio    valoracion
count  10000.000000      10000.000000  10000.000000  10000.000000
mean     247.862400          5.934300    253.985718      2.503540
std      143.194803          3.184022    142.683054      1.448883
min        1.000000          1.000000      5.020000      0.000000
25%      123.000000          3.000000    130.755000      1.200000
50%      245.000000          6.000000    254.700000      2.500000
75%      369.000000          9.000000    377.637500      3.800000
max      500.000000         11.000000    499.960000      5.000000

In [38]:
df2 = df1.copy()

In [39]:
df2.head(3)

,usuario,categorias,numero_articulos,fecha,precio,valoracion,comentarios
0,92,Baño,8,2019-03-27 21:08:33.786039,343.53,0.5,no llego el producto
1,265,Baño,6,2019-08-08 15:19:19.873440,78.43,3.7,justo lo que esperaba
2,106,Baño,7,2020-11-10 18:56:30.101786,446.09,2.4,no llego en tiempo

## Creacion de proveedores por categorias 
* Electronica = 'General Electric' , 'Bosch', 'Samsumg' 'Apple', 'Sony' 
* Deporte = 'Adidas', 'Nike', ' Under Armour', 'Asics' 
* Juguetes = 'Lego', 'Playmobile', 'Chicco' , 'Fisher-price' 
* Libros = 'Platena Comic' , 'Alianza Editorial' , 'Valdemar' , 'Ediciones Tomodomo' 
* Accesorios = 'Polo' ,'Ray-ban' , ' Michael Kors', 'Bimba y Lola' 
* Cocina = 'Bimbo' , 'Oscar mayer', 'Nescafe' , 'Flora'
* Ropa =  'Roxy' , 'Lacoste' , 'Hollister', 'Levis' 
* Hogar = 'Vileda', 'Colgate - palmolive' , 'Unilever', 'Henkel' 
* Baño = 'KH7', 'Don limpio', 'Cristasol', 'Cif'
* Ferreteria = 'Sika', '3M', 'Yale', Pavco'

In [40]:

def proveedores(categoria):


    proveedores_electronica  = ['General Electric', 'Samsumg', 'Apple', 'Sony' ]
    proveedores_deportes = ['Adidas', 'Nike', 'Under Armour', 'Asics'] 
    proveedores_juguetes = ['Lego', 'Playmobile', 'Chicco' , 'Fisher-price' ]
    proveedores_libros = ['Platena Comic' , 'Alianza Editorial' , 'Valdemar' , 'Ediciones Tomodomo'  ]
    proveedores_accesorios = ['Polo' ,'Ray-ban' , ' Michael Kors', 'Bimba y Lola']
    proveedores_cocina = ['Bimbo' , 'Oscar mayer', 'Nescafe' , 'Flora']
    proveedores_ropa = ['Roxy' , 'Lacoste' , 'Hollister', 'Levis']
    proveedores_hogar = ['Vileda', 'Colgate - palmolive' , 'Unilever', 'Henkel' ]
    proveedores_baño = ['KH7', 'Don limpio', 'Cristasol', 'Cif']
    proveedores_ferreteria = ['Sika', '3M', 'Yale', 'Pavco' ]
    proveedores_zapatos = ['Camper', 'Skechers', 'Crocs', 'New balance']
    proveedor_categoria = []

    if categoria == 'Electronica':
        return proveedores_electronica[randint(0,3)]
    elif categoria == 'Deporte': 
       return proveedores_deportes[randint(0,3)]
    elif categoria == 'Juguetes': 
        return proveedores_juguetes[randint(0,3)]
    elif categoria == 'Libros': 
        return proveedores_libros[randint(0,3)]
    elif categoria == 'Accesorios': 
        return proveedores_accesorios[randint(0,3)]
    elif categoria == 'Cocina': 
        return proveedores_cocina[randint(0,3)]
    elif categoria =='Ropa': 
        return proveedores_ropa[randint(0,3)]
    elif categoria == 'Hogar': 
        return proveedores_hogar[randint(0,3)]
    elif categoria == 'Baño': 
        return proveedores_baño[randint(0,3)]
    elif categoria == 'Ferreteria': 
        return proveedores_ferreteria[randint(0,3)]
    elif categoria == 'Zapatos': 
        return proveedores_zapatos[randint(0,3)]

In [41]:
 proveedores ('Zapatos')

'Crocs'

In [42]:
df2['proveedores'] = df2['categorias']

In [43]:
df2.head()

,usuario,categorias,numero_articulos,fecha,precio,valoracion,comentarios,proveedores
0,92,Baño,8,2019-03-27 21:08:33.786039,343.53,0.5,no llego el producto,Baño
1,265,Baño,6,2019-08-08 15:19:19.873440,78.43,3.7,justo lo que esperaba,Baño
2,106,Baño,7,2020-11-10 18:56:30.101786,446.09,2.4,no llego en tiempo,Baño
3,24,Deporte,1,2020-08-28 10:26:59.585523,201.92,4.6,justo lo que esperaba,Deporte
4,214,Electronica,8,2020-06-24 08:37:07.365533,242.89,4.8,buena relacion calidad-precio,Electronica

In [44]:
df2['proveedores'] = df2['proveedores'].apply(proveedores)

In [45]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   usuario           10000 non-null  int64
 1   categorias        10000 non-null  object
 2   numero_articulos  10000 non-null  int64
 3   fecha             10000 non-null  datetime64[ns]
 4   precio            10000 non-null  float64
 5   valoracion        10000 non-null  float64
 6   comentarios       10000 non-null  object
 7   proveedores       10000 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(2), object(3)
memory usage: 625.1+ KB

In [47]:

df2.head(3)

,usuario,categorias,numero_articulos,fecha,precio,valoracion,comentarios,proveedores
0,92,Baño,8,2019-03-27 21:08:33.786039,343.53,0.5,no llego el producto,KH7
1,265,Baño,6,2019-08-08 15:19:19.873440,78.43,3.7,justo lo que esperaba,KH7
2,106,Baño,7,2020-11-10 18:56:30.101786,446.09,2.4,no llego en tiempo,Cristasol

In [48]:
df2.to_csv('sales_data.csv', index = False)

In [49]:
df2.head(3)

,usuario,categorias,numero_articulos,fecha,precio,valoracion,comentarios,proveedores
0,92,Baño,8,2019-03-27 21:08:33.786039,343.53,0.5,no llego el producto,KH7
1,265,Baño,6,2019-08-08 15:19:19.873440,78.43,3.7,justo lo que esperaba,KH7
2,106,Baño,7,2020-11-10 18:56:30.101786,446.09,2.4,no llego en tiempo,Cristasol

In [51]:
df0.head(3)

,usuario,genero,edad,ciudad,gasto_mes,miembro_plus,dispositivo,tiempo_mes
0,1,Mujer,21,Valladolid,483.81,0,PC,3.30
1,2,Mujer,45,Valladolid,186.30,1,PC,6.60
2,3,Mujer,64,Murcia,396.03,0,PC,2.09

In [52]:
df_city = df0[['usuario', 'ciudad']]

In [53]:
df_city.head(3)

   usuario      ciudad
0        1  Valladolid
1        2  Valladolid
2        3      Murcia

In [54]:
lista_columnas_df2 = df2.columns.to_list()

In [55]:
del lista_columnas_df2 [4:7]

In [56]:
#usuario, fecha, categoria,  numero de artículos, proveedores

In [57]:
print (lista_columnas_df2)

['usuario', 'categorias', 'numero_articulos', 'fecha', 'proveedores']

In [58]:
df_users = df2[lista_columnas_df2]

In [61]:
df_users.head(3)

   usuario categorias  numero_articulos                      fecha proveedores
0       92       Baño                 8 2019-03-27 21:08:33.786039         KH7
1      265       Baño                 6 2019-08-08 15:19:19.873440         KH7
2      106       Baño                 7 2020-11-10 18:56:30.101786   Cristasol

In [62]:
df_union = df_users.set_index('usuario').join(df_city.set_index('usuario'))

In [63]:
df_union.head(3)

,categorias,numero_articulos,fecha,proveedores,ciudad
usuario,,,,,
1,Cocina,2,2019-11-30 13:17:43.023114,Flora,Valladolid
1,Baño,6,2020-07-07 16:23:03.531212,Don limpio,Valladolid
1,Baño,6,2019-01-09 10:04:02.121072,Cristasol,Valladolid

In [92]:
# Index reset
df3 = df_union.reset_index()

In [195]:
#Ahorrar en transporte: predicción de ventas por categoria segun ciudad y época del año

In [93]:
df3.head(3)

,usuario,categorias,numero_articulos,fecha,proveedores,ciudad
0,1,Cocina,2,2019-11-30 13:17:43.023114,Flora,Valladolid
1,1,Baño,6,2020-07-07 16:23:03.531212,Don limpio,Valladolid
2,1,Baño,6,2019-01-09 10:04:02.121072,Cristasol,Valladolid

In [94]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   usuario           10000 non-null  int64
 1   categorias        10000 non-null  object
 2   numero_articulos  10000 non-null  int64
 3   fecha             10000 non-null  datetime64[ns]
 4   proveedores       10000 non-null  object
 5   ciudad            10000 non-null  object
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 468.9+ KB

In [87]:
# Define the date format
df3['fecha'] = df3['fecha'].dt.strftime("%Y/%m/%d")

In [88]:
df3.head(3)

   usuario categorias  numero_articulos       fecha proveedores      ciudad
0        1     Cocina                 2  2019/11/30       Flora  Valladolid
1        1       Baño                 6  2020/07/07  Don limpio  Valladolid
2        1       Baño                 6  2019/01/09   Cristasol  Valladolid

In [68]:
# Ahorrar en transporte: predicción de ventas por categoria segun ciudad y época del año

### Definición de las temporadas

* Primavera - De finales de marzo a finales de junio.
* Verano – De finales de junio a finales de septiembre. ...
* Otoño – De finales de septiembre a finales de diciembre. ...
* Invierno – De finales de diciembre a finales de marzo.

In [69]:
def season (fecha):
    """ 
    El formato para la fecha Año/Mes/Dia
     """
    if (fecha in  pd.date_range(start='31/03/2019', end='29/06/2019')):
        return 'Primavera'
    elif fecha in  pd.date_range(start='31/03/2020', end='29/06/2020'):
        return 'Primavera'
    elif (fecha in  pd.date_range(start='30/06/2019', end='29/09/2019')):
        return 'Verano'
    elif (fecha in  pd.date_range(start='30/06/2020', end='29/09/2020')):
        return 'Verano'
    elif (fecha in  pd.date_range(start='30/09/2019', end='30/12/2019')):
        return 'Otoño'
    elif (fecha in  pd.date_range(start='30/10/2020', end='30/12/2020')):
        return 'Otoño'
    elif (fecha in  pd.date_range(start='31/12/2018', end='30/03/2019')):
        return 'Invierno'
    elif (fecha in  pd.date_range(start='31/12/2019', end='30/03/2020')):
        return 'Invierno'
    else: 
        return 'Fecha incorrecta'

In [70]:
season ('2020/03/01')

'Invierno'

In [71]:
df3['fecha'] = df3['fecha'].apply(season)

In [72]:
df3.head(3)

   usuario categorias  numero_articulos     fecha proveedores      ciudad
0        1     Cocina                 2     Otoño       Flora  Valladolid
1        1       Baño                 6    Verano  Don limpio  Valladolid
2        1       Baño                 6  Invierno   Cristasol  Valladolid

In [226]:
# Necesitamos reducir fechas para poder separar por estacion del año

# INQUIETUDES BASICAS DE NEGOCIO: 
* 1- Sacar ciudad que mas vende 
* 2- Proveedores mas vendidos por ciudad
* 3- Epoca del año con mas ingresos 
* 4- Total de ventas
* 5- Proveedor con mejor valoracion 
* 6- Proveedores con menos ventas 
* 7- Wordcloud con comentarios 

OPCIONES DE TOTALIZACION:
- SEGUN LA CIUDAD Y TEMPORADA SACAR LAS VENTAS POR PROVEEDOR TOTALIZANDO EL NUMERO DE ARTICULOS

In [73]:
df_precio = df2[['usuario', 'precio']]

In [83]:
print(f'df precio: {df_precio.shape}')
print(f'df3: {df3.shape}')

df precio: (10000, 2)
df3: (10000, 6)

In [75]:
# df_union = df_users.set_index('usuario').join(df_city.set_index('usuario'))
df_season_price = df3.set_index('usuario').join(df_precio.set_index('usuario'))

In [80]:
df_season_price.reset_index()

,usuario,categorias,numero_articulos,fecha,proveedores,ciudad,precio
0,1,Cocina,2,Otoño,Flora,Valladolid,112.28
1,1,Cocina,2,Otoño,Flora,Valladolid,479.51
2,1,Cocina,2,Otoño,Flora,Valladolid,459.00
3,1,Cocina,2,Otoño,Flora,Valladolid,435.76
4,1,Cocina,2,Otoño,Flora,Valladolid,410.19
...,...,...,...,...,...,...,...
209457,500,Ferreteria,4,Primavera,Pavco,Malaga,333.22
209458,500,Ferreteria,4,Primavera,Pavco,Malaga,154.53
209459,500,Ferreteria,4,Primavera,Pavco,Malaga,410.96
209460,500,Ferreteria,4,Primavera,Pavco,Malaga,196.86
209461,500,Ferreteria,4,Primavera,Pavco,Malaga,473.60

In [79]:
df_season_price.head(3)

        categorias  numero_articulos  fecha proveedores      ciudad  precio
usuario
1           Cocina                 2  Otoño       Flora  Valladolid  112.28
1           Cocina                 2  Otoño       Flora  Valladolid  479.51
1           Cocina                 2  Otoño       Flora  Valladolid  459.00

In [378]:
df2.head()

,Usuario,Categorias,Numero_articulos,Fecha,Precio,Valoracion,Comentarios,Proveedores
0,191,Ropa,2,2019-06-24 10:07:19.246642,407.99,2.6,llego justo a tiempo,Levis
1,362,Accesorios,11,2020-06-11 21:21:23.973773,261.75,1.6,el paquete llego en mal estado,Bimba y Lola
2,266,Zapatos,4,2020-01-02 23:52:46.675819,57.55,1.0,no cumple las expectativas,New balance
3,436,Ropa,4,2020-07-28 06:56:23.275207,434.75,3.5,cumple las expectativas,Hollister
4,28,Electronica,5,2020-10-29 04:01:34.449135,54.40,2.1,la calidad no es la esperada,Apple